In [14]:
import numpy as np
import pandas as pd

In [3]:
sales = [{'account': 'Jones LLC', 'Jan': 150, 'Feb': 200, 'Mar': 140},
         {'account': 'Alpha Co',  'Jan': 200, 'Feb': 210, 'Mar': 215},
         {'account': 'Blue Inc',  'Jan': 50,  'Feb': 90,  'Mar': 95 }]

df = pd.DataFrame(sales)
df

     account  Jan  Feb  Mar
0  Jones LLC  150  200  140
1   Alpha Co  200  210  215
2   Blue Inc   50   90   95

In [4]:
df['account']

0    Jones LLC
1     Alpha Co
2     Blue Inc
Name: account, dtype: object

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   account  3 non-null      object
 1   Jan      3 non-null      int64
 2   Feb      3 non-null      int64
 3   Mar      3 non-null      int64
dtypes: int64(3), object(1)
memory usage: 224.0+ bytes

In [11]:
df['total'] = df['Jan'] + df['Feb'] + df['Mar']

In [22]:
df['mean'] = df[['Jan','Feb','Mar']].mean(axis = 1)

In [34]:
df['mean'] = df[['Jan','Feb','Mar']].mean(axis=1)

In [35]:
df

     account  Jan  Feb  Mar  total        mean
0  Jones LLC  150  200  140    490  163.333333
1   Alpha Co  200  210  215    625  208.333333
2   Blue Inc   50   90   95    235   78.333333

In [46]:
selected = df[ df['total']>500 ]
selected

    account  Jan  Feb  Mar  total        mean
1  Alpha Co  200  210  215    625  208.333333

In [52]:
df.append({'account':'Apple', 'Feb':80, 'Mar':70, 'Apr':110}, ignore_index=True)

/var/folders/03/yj771kx92fj0g_3xbr70x6980000gn/T/ipykernel_74386/2442272461.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append({'account':'Apple', 'Feb':80, 'Mar':70, 'Apr':110}, ignore_index=True)

     account    Jan  Feb  Mar  total        mean    Apr
0  Jones LLC  150.0  200  140  490.0  163.333333    NaN
1   Alpha Co  200.0  210  400  625.0  208.333333    NaN
2   Blue Inc   50.0   90   95  235.0   78.333333    NaN
3      Apple    NaN   80   70    NaN         NaN  110.0

In [55]:
pd.concat([df, 
           pd.DataFrame([{'account':'Apple', 
                          'Feb':80, 
                          'Mar':70, 
                          'Apr':110}])]
          axis=0)

     account    Jan  Feb  Mar  total        mean    Apr
0  Jones LLC  150.0  200  140  490.0  163.333333    NaN
1   Alpha Co  200.0  210  400  625.0  208.333333    NaN
2   Blue Inc   50.0   90   95  235.0   78.333333    NaN
0      Apple    NaN   80   70    NaN         NaN  110.0

In [58]:
df[['Jan','Feb','Mar']]= df[['Jan','Feb','Mar']].astype('float')

In [59]:
df

     account    Jan    Feb    Mar  total        mean
0  Jones LLC  150.0  200.0  140.0    490  163.333333
1   Alpha Co  200.0  210.0  400.0    625  208.333333
2   Blue Inc   50.0   90.0   95.0    235   78.333333